{
  "name": "Makaira Connect",
  "code": "MakairaConnect",
  "repositoryName": "gambio-connect",
  "shopIdentifier": "makaira-connect",
  "type": "module",
  "version": "1.1.3",
  "title": {
    "en": "Makaira Connect",
    "de": "Makaira Connect"
  },
  "description": {
    "en": "<p>The <b>Makaira module</b> combines three powerful features - <b>Search & Filter, recommendations and promotions</b><img class='img-fluid' alt='search' src='[search.png]' /> - and offers you the ultimate control over the visibility and findability of your products.</p><p><b>Search & Filter: Optimal control over product searches</b><br/>With the powerful search engine, you determine which content in your Gambio shop should be searched. It is up to you whether you want to limit the search to product names and manufacturers or also include descriptions. Using the boost factor, you can specify which fields should be given more weight, so that, for example, the manufacturer's name appears more prominently in the search results. In addition, by manually specifying synonyms and antonyms, ambiguities in the search can be avoided and your customers can find exactly what they are looking for.</p><p><b>Recommendations: Intelligent product recommendations</b><img class='img-fluid' alt='Recommendation' src='[recommendation.png]'/><img class='img-fluid' alt='Recommendation Detail' src='[recommendation-detail.png]'/><br/>With the Recommendations feature, you actively support your customers in their product selection. You can recommend relevant items on the product pages of your shop - there are six pre-made recommendation types available. If that's not enough, you can also add your own recommendation options if you wish. To keep the suggestions dynamic, an optional random factor ensures that new products are displayed again and again. This not only increases the length of stay, but also sales.</p><p><b>Promotions: Effective sales promotion</b><img class='img-fluid' alt='Promotion' src='[promotion.png]' /><br/>The promotions feature is your tool for drawing attention to specific products. Whether it's items with particularly good margins or current bestsellers - you can place them prominently in the search results and on subpages of your shop. Complement this with individual banners and enable your customers to find the most relevant products immediately.</p><p>The <b>Makaira module</b> combines these three functions in a comprehensive solution to offer you maximum flexibility and efficiency in your e-commerce.</p>",
    "de": "<p>Das <b>Makaira-Modul</b> vereint drei leistungsstarke Features – <b><img class='img-fluid' alt='search' src='[search.png]' /> Suche & Filter, Recommendations und Promotions</b> – und bietet dir die ultimative Kontrolle über die Sichtbarkeit und Auffindbarkeit deiner Produkte.</p><p><b>Suche & Filter: Optimale Kontrolle über die Produktsuche</b><br/>Mit der leistungsstarken Such-Engine bestimmst du, welche Inhalte deines Gambio-Shops durchsucht werden sollen. Ob du die Suche auf Produktnamen und Hersteller beschränken oder auch Beschreibungen einbeziehen möchtest, bleibt dir überlassen. Durch den Boost-Faktor kannst du festlegen, welche Felder stärker gewichtet werden sollen, sodass beispielsweise der Herstellername prominenter in den Suchergebnissen auftaucht. Zusätzlich lassen sich durch die manuelle Festlegung von Synonymen und Antonymen Unklarheiten in der Suche vermeiden und deine Kunden finden genau das, was sie suchen.</p><p><b>Recommendations: Intelligente Produktempfehlungen</b><img class='img-fluid' alt='Recommendation' src='[recommendation.png]'/><img class='img-fluid' alt='Recommendation Detail' src='[recommendation-detail.png]'/><br/>Mit dem Recommendations-Feature unterstützt du deine Kunden aktiv bei der Produktauswahl. Auf den Produktseiten deines Shops kannst du relevante Artikel empfehlen – dabei stehen dir sechs vorgefertigte Empfehlungstypen zur Verfügung. Sollte das nicht ausreichen, kannst du auf Wunsch auch eigene Empfehlungsoptionen hinzufügen. Um die Vorschläge dynamisch zu halten, sorgt ein optionaler Zufallsfaktor dafür, dass immer wieder neue Produkte angezeigt werden. So steigerst du nicht nur die Verweildauer, sondern auch den Umsatz.</p><p><b>Promotions: Effektive Verkaufsförderung</b><img class='img-fluid' alt='Promotion' src='[promotion.png]' /><br/>Das Promotions-Feature ist dein Tool, um gezielt auf bestimmte Produkte aufmerksam zu machen. Ob es sich um Artikel mit besonders guten Margen oder aktuellen Bestsellern handelt – du kannst sie in den Suchergebnissen und auf Unterseiten deines Shops prominent platzieren. Ergänze dies durch individuelle Banner und ermögliche es deinen Kunden, die relevantesten Produkte sofort zu finden.</p><p>Das <b>Makaira-Modul</b> vereint diese drei Funktionen in einer umfassenden Lösung, um dir maximale Flexibilität und Effizienz in deinem E-Commerce zu bieten.</p>"
  },
  "vendor": {
    "name": "marmalade GmbH",
    "url": "https://makaira.io/",
    "avatar": "",
    "gitlabGroupName": "makairaio"
  },
  "displayImage": {
    "en": "/images/placeholder.png",
    "de": "/images/placeholder.png"
  },
  "highlights": [
    {
      "title": {
        "en": "Search & Filtering",
        "de": "Suche & Filter"
      }
    },
    {
      "title": {
        "en": "Advertising Spaces and Banners",
        "de": "Werbeplätze & Banner"
      }
    },
    {
      "title": {
        "en": "Recommendations",
        "de": "Recommendations"
      }
    }
  ],
  "migrations": {
    "up": [],
    "down": []
  },
  "requirements": {
    "hidden": {
      "shop": {
        "shopKeys": [],
        "shopUrls": [],
        "shopVersions": []
      },
      "server": {
        "phpVersions": [],
        "mysqlVersions": []
      },
      "themes": [],
      "modules": {
        "hub": [],
        "payment": [],
        "shipping": [],
        "orderTotal": [],
        "moduleCenter": []
      },
      "receiptFiles": []
    },
    "needed": {
      "shop": {
        "shopKeys": [],
        "shopUrls": [],
        "shopVersions": [
          ">=5.0.*"
        ]
      },
      "server": {
        "phpVersions": [
          ">=8.0"
        ],
        "mysqlVersions": []
      },
      "themes": [],
      "modules": {
        "hub": [],
        "payment": [],
        "shipping": [],
        "orderTotal": [],
        "moduleCenter": []
      },
      "receiptFiles": []
    },
    "forbidden": {
      "shop": {
        "shopKeys": [],
        "shopUrls": [],
        "shopVersions": []
      },
      "server": {
        "phpVersions": [],
        "mysqlVersions": []
      },
      "themes": [],
      "modules": {
        "hub": [],
        "payment": [],
        "shipping": [],
        "orderTotal": [],
        "moduleCenter": []
      },
      "receiptFiles": []
    }
  }
}
